In [15]:
import pandas as pd
import pymysql
pymysql.install_as_MySQLdb()
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists
import json

In [5]:
with open("c:/Users/oscar/.secret/sql_key.json") as f:
    login = json.load(f)
login.keys()

dict_keys(['sql_key'])

# Creating data base

In [14]:
connection = f"mysql+pymysql://root:{login['sql_key']}@localhost/books"

In [16]:
engine = create_engine(connection)

In [17]:
create_database(connection)

In [18]:
database_exists(connection)

True

# Importing data

In [19]:
users = pd.read_csv("Data/users.csv")
authors = pd.read_csv("Data/authors.csv")
books = pd.read_csv("Data/books.csv")
favorites = pd.read_csv("Data/favorites.csv")

In [35]:
df_names = ["users", "authors", "books", "favorites"]
df_list = [users, authors, books, favorites]

# Converting to sql tables

In [37]:
for x, df in enumerate(df_list):
    df.to_sql(df_names[x], engine, if_exists="replace")

# Queries

In [39]:
q ="""SHOW TABLES;"""
pd.read_sql(q, engine)

  Tables_in_books
0         authors
1           books
2       favorites
3           users

In [40]:
john_doe = """SELECT b.title, f.user_id
              FROM books AS b
              JOIN favorites AS f ON b.id = f.book_id
              WHERE f.user_id = 
                  (SELECT users.id FROM users WHERE (users.last_name = 'Doe' AND users.first_name = 'John'));"""
pd.read_sql(john_doe, engine)

              title  user_id
0       The Shining        1
1                It        1
2  The Great Gatsby        1